[
    {
        "id": "623edb127e9b2a2a29e8b31d",
        "name": "T McClellan",
        "rating": 5,
        "review": "I was diagnosed with plantar fasciitis recently and needed a stiffer soled shoe once I resumed exercise. I found these and decided to try them out. My doctor recommended shoes that cost twice as much. On a whim I bought these and the more expensive shoes."
    },
    {
        "id": "623edb12fb3f16628697baf7",
        "name": "Stephen",
        "rating": 5,
        "review": "Got these because I’m tired of the decline of new balance and under armor offers and extra wide size. These are better quality and true to fit."
    },
    {
        "id": "623edb128b699be16baa7255",
        "name": "Ross",
        "rating": 5,
        "review": "Under Armour shoes are very comfortable and easy on my feet. I used to wear NB but I like Under Armour a little better. I wear the shoes while working out and when they get old I will use them for yard work and then buy another pair."
    },
    {
        "id": "623edb12bdc996a042648e71",
        "name": "Warren S",
        "rating": 4.5,
        "review": "Great shoe, my first time buying Under Armour. I wear these to work in the office and it gives me good comfort and support to wear for 10 hours straight. I used to buy Nike all the time, but now I might be convinced of getting Under Armour from now on."
    },
    {
        "id": "623edb1223331b920f3c70c7",
        "name": "Mark Riddle",
        "rating": 5,
        "review": "This is the second pair of these now. I wore the others out. I am a men’s size. 9.5. My first pair was a tiny bit tight in the tow-still extremely comfortable. I went up to a 10 for this new pair. They are amazing."
    },
    {
        "id": "623edb1297ad19a802e77467",
        "name": "Peter",
        "rating": 4.5,
        "review": "I was looking for a comfortable everyday shoe suitable for casual active use. These fit the bill perfectly. A few notes: They are pretty generic looking on the foot. No problem here for that. My initial review indicated that the shoe was not as wide as expected for a wide size."
    }
]